import random as random

print('Здравствуй дорогой друг , спасибо что решил пройти этот квест, приятной игры!')
name = input('Введи свое имя --- ')
print('-')
print('-')
print("Глава-1. Вы попали в темный жуткий лес \n"
      "---------Где  кроме своего дыхания \n"
      "---------ты ничего не слышишь\n"
      "---------кроме своих ног\n"
      "---------ничего не видишь.Страшно.....\n"
      "--------------------------------------\n"
      "Что ты думаешь первым тебе стоит сделать ?\n"
      "- - - - - - -  - - - - - - - - - -  - - - ")
hod1 = input('''1.[Поискать ,что можно поджечь]
2.[Лечь спать на траве]

--- ''')

if hod1 ==  '1':
    print('Ты  нашел большую сухую палку ')
    hod2 = input('Что ты будешь с  ней делать?\n'
                 '1.[подожгу]\n'
                 '2.[выброшу]\n'
                 '    ---')
    if hod2 == '1':
        print("аххахаахах, а чем ты будешь поджигать.....")
        hod3 = input('Хорошо , ты решил заглянуть себе в карман \n'
                     'и нашел зажигалку.......будь внимательнее\n'
                     '-----------------------------------------\n'
                     'Светом от "факела" ты осветил себе путь\n'
                     'и вдруг увидел мужика , идущего на тебя\n'
                     '\n'
                     'Что ты будешь делать в данной ситуации?\n'
                     '\n'
                     '1.[пойду на встречу]\n'
                     '2.[останусь на месте]\n'
                     '\n'
                     '--- ')
        if hod3 == '1':
            print('Этим мужиком оказался обычний лесничий и он пригласил тебя к себе в хибару')
            hod4 = input('Лесничий предложил тебе выпить \n'
                         '1.[пить]\n'
                         '2.[отказаться]\n'
                         '\n'
                         '--- ')
            if hod4 == '1':
                print("Лесничий рассказывает душещипательную историю как давным давно потерял своего сына")
                hod5 = input('1.[пойти на поиски]\n'
                             '2.[пить дальше]\n'
                             '\n'
                             '--- ')
                if hod5 == '1':
                    print('Первым делом ты решил опросить людей в близь лежащей деревене')
                    print('что они об этом знают')
                    hod6 = input('ы подошел к старой, сморщенной , противной старухе \n'
                                 'Она остановила тебя и сказала, что где-то уже видела тебя\n'
                                 '\n'
                                 '1.[поговорить с ней]\n'
                                 '2.[пройти мимо]\n'
                                 '\n'
                                 '--- ')
                    if hod6 == '1':
                        print('Поговорив с этой старухой , вы узнали, что она')
                        print('узнает людей по походке, и у неё появилось такое ощущение')
                        print('что она уже знала челоека с такой походкой')
                        hod7 = input('Старуха спросила сколько тебе лет\n'
                                     '\n'
                                     '1.[15]\n'
                                     '2.[17]\n'
                                     '3.[19]\n'
                                     '4.[21]\n'
                                     '\n'
                                     '---- ')
                        if hod7 == '4':
                            print('О боже, а тебя случайно зовут не',name+'?')
                            print('Старуха рассказывает вам , что вспомнила ,что видела такую походку\n'
                                  'У сына Лесника и его как раз звали', name, ('и он пропал 12 лет назад\n'
                                                                               '\n'
                                                                               '-------------------------\n'
                                                                               '\n'
                                                                               'Вы в шоке идете к Леснику и вы рассказываете ему что вы узнали. С заплаканными глазами он вас обнимает и говорит, что он знал что вы его сын , но он не мог вспомнить его имя и ему было очень стыдно.....\n'
                                                                               '\n'
                                                                               'КОНЕЦ, спасибо что прошли квест , вы вышли на лучшую концовку!'))
                        elif hod7 == '1'  or hod7 == '2' or hod7 == '3':
                            print("Старуха говорит, что обозналась")
                            print('Вы решили пойти дальше, но вдруг наткунились на шпану')
                            print('Она предложила вам сыграть в игру "кто ближе" ')
                            print('Три человека называют 2 рандомных числа')
                            print('какое из них ближе к выпавшему в стакане, тот победил')
                            print('Если вы выигрваете ,то можете уйти от сюда живым')
                            hod8 = random.randint(0, 100)
                            per1 = random.randint(0, 100)
                            me = int(input('Введи число от 0 до 100 - '))
                            win1 = hod8 - me
                            win2 = hod8 - per1
                            if win1 < win2  :
                                print('---------------------------')
                                print('Ты выиграл , поздравляю!')
                                print('Вы пошли дальше ,сломали ногу  и в итоге она сгинла, и вам ее отрезали')
                                print('теперь вы инвалид ')
                                print('---------------------------')
                                print('Конец квеста - вы вышли на не очень хорошую концовку')
                            elif win1 > win2  :
                                print('---------------------------')
                                print('Ты проиграл.....')
                                print('Вас убили и бросили в ближайшую канаву')
                                print('---------------------------')
                                print('Конец квеста - вы вышли на не очень хорошую концовку')
                    elif hod6 == '2':
                        print('Вы решили пойти дальше, но вдруг наткунились на шпану')
                        print('Она предложила вам сыграть в игру "кто ближе" ')
                        print('Три человека называют 2 рандомных числа')
                        print('какое из них ближе к выпавшему в стакане, тот победил')
                        print('Если вы выигрваете ,то можете уйти от сюда живым')
                        hod8 = random.randint(0, 100)
                        per1 = random.randint(0, 100)
                        print('---------------------------')
                        me = int(input('Введи число от 0 до 100 - '))
                        win1 = hod8 - me
                        win2 = hod8 - per1
                        if win1 < win2:
                            print('---------------------------')
                            print('Ты выиграл , поздравляю!')
                            print('Вы пошли дальше ,сломали ногу  и в итоге она сгинла, и вам ее отрезали')
                            print('теперь вы инвалид ')
                            print('---------------------------')
                            print('Конец квеста - вы вышли на не очень хорошую концовку')
                        elif win1 > win2:
                            print('---------------------------')
                            print('Ты проиграл.....')
                            print('Вас убили и бросили в ближайшую канаву')
                            print('---------------------------')
                            print('Конец квеста - вы вышли на не очень хорошую концовку')
                elif hod5 == '2':
                    print('Вы очень много пили и решили пойти на улицу, и уснули там')
                    pogoda = int(input("Сколько градусов по цельсию было сегодня ночью?\n"
                                       "\n"
                                       "Введи сколько было градусов от 1 до 58\n"
                                       "\n"
                                       "или пусть решит рандомайзер\n"
                                       "\n"
                                       "0.[использовать рандомайзер]\n"
                                       "\n"
                                       "--- "))
                    if 1 <= pogoda < 15:
                        print('---------------------------')
                        print('Ночью из-за ты замерз и умер')
                        print('---------------------------')
                        print('КОНЕЦ... ты закончил квест на плохую концовку , с очень стыдной смертью')
                    elif 15 <= pogoda < 45:
                        print('---------------------------')
                        print('Ты нормально переночевал и с тобой ничего не случилось')
                        hod10 = input('И ты все такие решил пойти на поиски сына этого лесничего')
                        print('---------------------------')
                        print('Первым делом ты решил опросить людей в близь лежащей деревене')
                        print('что они об этом знают')
                        print('---------------------------')
                        hod6 = input('''ты подошел к старой, сморщенной , противной старухе 
                        Она остановила тебя и сказала, что где-то уже видела тебя

                        1.[поговорить с ней]
                        2.[пройти мимо]

                        --- ''')
                        if hod6 == '1':
                            print('Поговорив с этой старухой , вы узнали, что она')
                            print('узнает людей по походке, и у неё появилось такое ощущение')
                            print('что она уже знала челоека с такой походкой')
                            hod7 = input('''Старуха спросила сколько тебе лет

                        1.[15]
                        2.[17]
                        3.[19]
                        4.[21]

                        ---- ''')
                            if hod7 == '4':
                                print('О боже, а тебя случайно зовут не', name + '?')
                                print('''Старуха рассказывает вам , что вспомнила ,что видела такую походку
                        У сына Лесника и его как раз звали''', name, '''и он пропал 12 лет назад

                        -------------------------

                        Вы в шоке идете к Леснику и вы рассказываете ему что вы узнали. С заплаканными глазами он вас обнимает и говорит, что он знал что вы его сын , но он не мог вспомнить его имя и ему было очень стыдно.....

                        КОНЕЦ, спасибо что прошли квест , вы вышли на лучшую концовку!''')
                            elif hod7 == '1' or hod7 == '2' or hod7 == '3':
                                print("Старуха говорит, что обозналась")
                                print('Вы решили пойти дальше, но вдруг наткунились на шпану')
                                print('Она предложила вам сыграть в игру "кто ближе" ')
                                print('Три человека называют 2 рандомных числа')
                                print('какое из них ближе к выпавшему в стакане, тот победил')
                                print('Если вы выигрваете ,то можете уйти от сюда живым')
                                hod8 = random.randint(0, 100)
                                per1 = random.randint(0, 100)
                                me = int(input('Введи число от 0 до 100 - '))
                                win1 = hod8 - me
                                win2 = hod8 - per1
                                if win1 < win2:
                                    print('---------------------------')
                                    print('Ты выиграл , поздравляю!')
                                    print('Вы пошли дальше ,сломали ногу  и в итоге она сгинла, и вам ее отрезали')
                                    print('теперь вы инвалид ')
                                    print('---------------------------')
                                    print('Конец квеста - вы вышли на не очень хорошую концовку')
                                elif win1 > win2:
                                    print('---------------------------')
                                    print('Ты проиграл.....')
                                    print('Вас убили и бросили в ближайшую канаву')
                                    print('---------------------------')
                                    print('Конец квеста - вы вышли на не очень хорошую концовку')
                        elif hod6 == '2':
                            print('Вы решили пойти дальше, но вдруг наткунились на шпану')
                            print('Она предложила вам сыграть в игру "кто ближе" ')
                            print('Три человека называют 2 рандомных числа')
                            print('какое из них ближе к выпавшему в стакане, тот победил')
                            print('Если вы выигрваете ,то можете уйти от сюда живым')
                            hod8 = random.randint(0, 100)
                            per1 = random.randint(0, 100)
                            print('---------------------------')
                            me = int(input('Введи число от 0 до 100 - '))
                            win1 = hod8 - me
                            win2 = hod8 - per1
                            if win1 < win2:
                                print('---------------------------')
                                print('Ты выиграл , поздравляю!')
                                print('Вы пошли дальше ,сломали ногу  и в итоге она сгинла, и вам ее отрезали')
                                print('теперь вы инвалид ')
                                print('---------------------------')
                                print('Конец квеста - вы вышли на не очень хорошую концовку')
                            elif win1 > win2:
                                print('---------------------------')
                                print('Ты проиграл.....')
                                print('Вас убили и бросили в ближайшую канаву')
                                print('---------------------------')
                                print('Конец квеста - вы вышли на не очень хорошую концовку')
                    elif 45 <= pogoda < 58:
                        print('---------------------------')
                        print('Ночью из-за очень сильной жары ты умер от обезвоживания')
                        print('---------------------------')
                        print('КОНЕЦ... ты закончил квест на плохую концовку , с очень стыдной смертью')
                    elif pogoda == 0:
                        z = random.randint(1, 58)
                        if 1 <= z < 15:
                            print('---------------------------')
                            print('Ночью из-за ты замерз и умер. Ночью температура была =', z)
                            print('---------------------------')
                            print('КОНЕЦ... ты закончил квест на плохую концовку , с очень стыдной смертью')

                        elif 15 <= z < 45:
                            print('---------------------------')
                            print('Ты нормально переночевал и с тобой ничего не случилось. Ночью температура была =', z)
                        elif 45 <= z < 58:
                            print('---------------------------')
                            print('Ночью из-за очень сильной жары ты умер от обезвоживания. Ночью температура была =', z)
                            print('---------------------------')
                            print('КОНЕЦ... ты закончил квест на плохую концовку , с очень стыдной смертью')
                    elif pogoda < 0:
                        print('Столько градусов может быть только зимой')
            elif hod4 == '2':
                print('Вы очень обидели лесничего')
                print('---------------------------')
                print('Лесничий предложил сыграть в 21(карточная игра) Но чуть-чуть с измененными правилами \n'
                      '\n'
                      '1. Вы можете взять только 3 карты\n'
                      '\n'
                      '2. Чтобы выиграть вы должны суммарно набрать от 15 до 21 включительно\n'
                      '\n'
                      '3.Играете только вы один\n'
                      '\n'
                      '4.Если у вас получается больше чем 21 вы проигрываете ')
                print('---------------------------')
                print("ps: Если вы проиграете , он вас убьет(((")
                you = random.randint(2, 11)
                print('Вам выпало', you, 'очка/ов')
                print('---------------------------')
                card = input('Вам нужны еще карты?\n'
                             '\n'
                             '1.[Да]\n'
                             '\n'
                             '--- ')
                if card == '1':
                    more = random.randint(6, 11)
                    you_2 = more + you
                    if you_2 > 21:
                        print('Перебор, вы проиграли')
                    else:
                        print('Теперь', you_2, 'очка/ов')
                        card_1 = input('Вам нужны еще карты?\n'
                                       '\n'
                                       '                                    1.[Да]\n'
                                       '                                    2.[Нет]\n'
                                       '\n'
                                       '                                    --- ')
                        if card_1 == '1':
                            more_1 = random.randint(6, 11)
                            itog = more_1 + you_2
                            if 15 < itog <= 21:
                                print('Ты победил, у тебя', itog, 'очка/ов')
                                print('---------------------------')
                                print('Лесничий настолько разозлися ,что ты выиграл  , что тебя решил все равно тебя убить')
                                print('---------------------------')
                                print('КОНЕЦ... ты закончил квест на плохую концовку')
                            elif 0 < itog <= 15:
                                print('Ты проигралу тебя', itog, 'очка/ов')
                                print('---------------------------')
                                print('Лесничий ,сдержал обещание и убил тебя')
                                print('---------------------------')
                                print('КОНЕЦ... ты закончил квест на плохую концовку')
                            elif itog > 21:
                                print('Перебор, ты проигралу тебя', itog, 'очка/ов')
                                print('---------------------------')
                                print('Лесничий ,сдержал обещание и убил тебя')
                                print('---------------------------')
                                print('КОНЕЦ... ты закончил квест на плохую концовку')
                        elif card_1 == '2':
                            if 15 < you_2 <= 21:
                                print('Ты победил у тебя', you_2, 'очка/ов')
                                print('---------------------------')
                                print('Лесничий настолько разозлися ,что ты выиграл  , что тебя решил все равно тебя убить')
                                print('---------------------------')
                                print('КОНЕЦ... ты закончил квест на плохую концовку')
                            elif 0 < you_2 <= 15:
                                print('Ты проиграл', you_2, 'очка/ов')
                                print('---------------------------')
                                print('Лесничий ,сдержал обещание и убил тебя')
                                print('---------------------------')
                                print('КОНЕЦ... ты закончил квест на плохую концовку')
                            elif you_2 > 21:
                                print('Перебор, ты проиграл', you_2, 'очка/ов')
                                print('---------------------------')
                                print('Лесничий ,сдержал обещание и убил тебя')
                                print('---------------------------')
                                print('КОНЕЦ... ты закончил квест на плохую концовку')
        elif hod3 == '2':
            print("Вдруг , откуда не возьмись, появились \n"
                  "Гномы и у тащили тебя к себе в подземелье\n"
                  "\n"
                  "Они, сказали- \n"
                  "Если выиграешь нас в кости, то мы тебе расскажем большой секрет,\n"
                  "а если нет, то мы убьем тебя")
            game = random.randint(1, 6)
            game_2 = random.randint(1, 6)
            gnom = random.randint(1, 6)
            gnom_2 = random.randint(1,6)
            it_me = game+game_2
            it_gn = gnom+gnom_2
            play = input('Будем играть?\n'
                         '\n'
                         '1.[Да]\n'
                         '2.[Нет]\n'
                         '\n'
                         '-----')
            if play == '1':
                if it_me>it_gn:
                   print('---------------------------')
                   print('Твое количесвто очков - ', it_me)
                   print('---------------------------')
                   print('Количество очков гномов - ', it_gn)
                   print('---------------------------')
                   print('Итог- ТЫ ПОБЕДИЛ!')
                   print('Гномы не любят , когда их выигрывают\n'
                         '--------------\n'
                         'Гномы убили тебя\n'
                         '-------------\n'
                         'Конец, ты проиграл.......... так себе концовка ')
                elif it_me<it_gn:
                    print('---------------------------')
                    print('Твое количесвто очков - ', it_me)
                    print('---------------------------')
                    print('Количество очков гномов - ', it_gn)
                    print('---------------------------')
                    print("Итог- ты проиграл.......")
                    print('Ты проиграл\n'
                          '--------------\n'
                          'Гномы убили тебя\n'
                          '-------------\n'
                          'Конец, ты проиграл.......... так себе концовка\n')
                elif it_gn == it_me:
                    print('---------------------------')
                    print('Твое количесвто очков - ', it_me)
                    print('---------------------------')
                    print('Количество очков гномов - ', it_gn)
                    print('---------------------------')
                    print('Итог- ничья')
                    print('Создатель не придумал , что делать в таком случае\n'
                          '\n'
                          'Будем считать , что тебя допустим убили\n'
                          'Мдаааа...........')
            elif play == '2':
                print('Ты просто ушел и все....... и больше никогда сюда не возвращался')
    elif hod2 == '2':
        print('Из-за того , что выбросил палку, собаки подумали , что ты \n'
              'Представляешь опасность для них и накинулись на тебя\n'
              '---------------\n'
              'Ты был искусан и изуродован \n'
              '---------------\n'
              'Конец, ты проиграл.......... так себе концовка ')



elif hod1 == '2':
  print('Ночью было холодно и ты умер(')
  print('---------------------------')
  print('КОНЕЦ... ты закончил квест на плохую концовку')




